# Дано натуральное число, не привышает 10000. Выведите его последнюю цифру.

n = int(input())
print(n % 10)
